app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT 5 OFFSET 0  [["user_id", "1"]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", "1"]]
---
  def index
    if params[:_method].present?

     @articles = current_user.articles.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "articles" ("name", "des", "post_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "gdfsg"], ["des", "dgddf"], ["post_type", "2"], ["user_id", "13"], ["created_at", "2016-06-29 11:54:31.351062"], ["updated_at", "2016-06-29 11:54:31.351062"]]
SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def create
     @article =current_user.articles.new(article_params)
     @article.save
    #@articles = Article.all
    @articles = Article.paginate(:page => params[:page], :per_page => 5)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "des" = ?, "post_type" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["des", "5222hdr"], ["post_type", "3"], ["updated_at", "2016-07-06 09:43:59.804209"], ["id", 94]]
SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def update
  @article = Article.find(params[:id])
  @article.update(article_params)
  #@articles = Article.all
  @articles = Article.paginate(:page => params[:page], :per_page => 5)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
 def destroy
    @article =Article.find(params[:id])
    @article.destroy
    #@articles = Article.all
     @articles = Article.paginate(:page => params[:page], :per_page => 5)