app/controllers/articles_controller.rb

def update
  @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", "11"], ["id", 45]]

 def destroy
    @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", "13"], ["id", 25]]